#### Terraform Plan`success`

<details><summary>Show Plan</summary>

```

terraform
module.aci.data.utils_yaml_merge.model: Reading...
module.aci.data.utils_yaml_merge.model: Read complete after 0s [id=ae5f459ae353ea0b2a72eb9f03f92fdd9e7e2674]
module.aci.data.utils_yaml_merge.defaults: Reading...
module.aci.data.utils_yaml_merge.defaults: Read complete after 0s [id=e5d7a4194bb4e6b6fcec82da42d7b4e789871848]
module.aci.local_sensitive_file.defaults[0]: Refreshing state... [id=e5d7a4194bb4e6b6fcec82da42d7b4e789871848]
module.aci.module.aci_tenant["Techtorial"].aci_rest_managed.fvTenant: Refreshing state... [id=uni/tn-Techtorial]
module.aci.module.aci_application_profile["Techtorial/DEV"].aci_rest_managed.fvAp: Refreshing state... [id=uni/tn-Techtorial/ap-DEV]
module.aci.module.aci_vrf["Techtorial/VRF1"].aci_rest_managed.fvCtx: Refreshing state... [id=uni/tn-Techtorial/ctx-VRF1]
module.aci.module.aci_vrf["Techtorial/VRF1"].aci_rest_managed.vzAny: Refreshing state... [id=uni/tn-Techtorial/ctx-VRF1/any]
module.aci.module.aci_vrf["Techtorial/VRF1"].aci_rest_managed.fvRsBgpCtxPol: Refreshing state... [id=uni/tn-Techtorial/ctx-VRF1/rsbgpCtxPol]
module.aci.module.aci_bridge_domain["Techtorial/VLAN103"].aci_rest_managed.fvBD: Refreshing state... [id=uni/tn-Techtorial/BD-VLAN103]
module.aci.module.aci_bridge_domain["Techtorial/VLAN101"].aci_rest_managed.fvBD: Refreshing state... [id=uni/tn-Techtorial/BD-VLAN101]
module.aci.module.aci_bridge_domain["Techtorial/VLAN102"].aci_rest_managed.fvBD: Refreshing state... [id=uni/tn-Techtorial/BD-VLAN102]
module.aci.module.aci_bridge_domain["Techtorial/VLAN103"].aci_rest_managed.fvRsCtx: Refreshing state... [id=uni/tn-Techtorial/BD-VLAN103/rsctx]
module.aci.module.aci_bridge_domain["Techtorial/VLAN101"].aci_rest_managed.fvRsCtx: Refreshing state... [id=uni/tn-Techtorial/BD-VLAN101/rsctx]
module.aci.module.aci_bridge_domain["Techtorial/VLAN102"].aci_rest_managed.fvRsCtx: Refreshing state... [id=uni/tn-Techtorial/BD-VLAN102/rsctx]
module.aci.module.aci_bridge_domain["Techtorial/VLAN103"].aci_rest_managed.fvSubnet["10.1.2.1/23"]: Refreshing state... [id=uni/tn-Techtorial/BD-VLAN103/subnet-[10.1.2.1/23]]
module.aci.module.aci_bridge_domain["Techtorial/VLAN101"].aci_rest_managed.fvSubnet["10.1.0.1/24"]: Refreshing state... [id=uni/tn-Techtorial/BD-VLAN101/subnet-[10.1.0.1/24]]
module.aci.module.aci_bridge_domain["Techtorial/VLAN102"].aci_rest_managed.fvSubnet["10.1.1.1/24"]: Refreshing state... [id=uni/tn-Techtorial/BD-VLAN102/subnet-[10.1.1.1/24]]
module.aci.module.aci_endpoint_group["Techtorial/DEV/VLAN102"].aci_rest_managed.fvAEPg: Refreshing state... [id=uni/tn-Techtorial/ap-DEV/epg-VLAN102]
module.aci.module.aci_endpoint_group["Techtorial/DEV/VLAN101"].aci_rest_managed.fvAEPg: Refreshing state... [id=uni/tn-Techtorial/ap-DEV/epg-VLAN101]
module.aci.module.aci_endpoint_group["Techtorial/DEV/VLAN103"].aci_rest_managed.fvAEPg: Refreshing state... [id=uni/tn-Techtorial/ap-DEV/epg-VLAN103]
module.aci.module.aci_endpoint_group["Techtorial/DEV/VLAN101"].aci_rest_managed.fvRsBd: Refreshing state... [id=uni/tn-Techtorial/ap-DEV/epg-VLAN101/rsbd]
module.aci.module.aci_endpoint_group["Techtorial/DEV/VLAN102"].aci_rest_managed.fvRsBd: Refreshing state... [id=uni/tn-Techtorial/ap-DEV/epg-VLAN102/rsbd]
module.aci.module.aci_endpoint_group["Techtorial/DEV/VLAN103"].aci_rest_managed.fvRsBd: Refreshing state... [id=uni/tn-Techtorial/ap-DEV/epg-VLAN103/rsbd]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.aci.module.aci_application_profile["Techtorial/DEV"].aci_rest_managed.fvAp has been deleted
  - resource "aci_rest_managed" "fvAp" {
      - content    = {
          - "name"      = "DEV"
            # (6 unchanged elements hidden)
        } -> null
      - id         = "uni/tn-Techtorial/ap-DEV" -> null
        # (2 unchanged attributes hidden)
    }

  # module.aci.module.aci_bridge_domain["Techtorial/VLAN101"].aci_rest_managed.fvBD has been deleted
  - resource "aci_rest_managed" "fvBD" {
      - content    = {
          - "name"                     = "VLAN101"
            # (27 unchanged elements hidden)
        } -> null
      - dn         = "uni/tn-Techtorial/BD-VLAN101" -> null
      - id         = "uni/tn-Techtorial/BD-VLAN101" -> null
        # (1 unchanged attribute hidden)
    }

  # module.aci.module.aci_bridge_domain["Techtorial/VLAN102"].aci_rest_managed.fvBD has been deleted
  - resource "aci_rest_managed" "fvBD" {
      - content    = {
          - "name"                     = "VLAN102"
            # (27 unchanged elements hidden)
        } -> null
      - dn         = "uni/tn-Techtorial/BD-VLAN102" -> null
      - id         = "uni/tn-Techtorial/BD-VLAN102" -> null
        # (1 unchanged attribute hidden)
    }

  # module.aci.module.aci_bridge_domain["Techtorial/VLAN103"].aci_rest_managed.fvBD has been deleted
  - resource "aci_rest_managed" "fvBD" {
      - content    = {
          - "name"                     = "VLAN103"
            # (27 unchanged elements hidden)
        } -> null
      - dn         = "uni/tn-Techtorial/BD-VLAN103" -> null
      - id         = "uni/tn-Techtorial/BD-VLAN103" -> null
        # (1 unchanged attribute hidden)
    }

  # module.aci.module.aci_endpoint_group["Techtorial/DEV/VLAN101"].aci_rest_managed.fvAEPg has been deleted
  - resource "aci_rest_managed" "fvAEPg" {
      - content    = {
          - "name"           = "VLAN101"
            # (13 unchanged elements hidden)
        } -> null
      - dn         = "uni/tn-Techtorial/ap-DEV/epg-VLAN101" -> null
      - id         = "uni/tn-Techtorial/ap-DEV/epg-VLAN101" -> null
        # (1 unchanged attribute hidden)
    }

  # module.aci.module.aci_endpoint_group["Techtorial/DEV/VLAN102"].aci_rest_managed.fvAEPg has been deleted
  - resource "aci_rest_managed" "fvAEPg" {
      - content    = {
          - "name"           = "VLAN102"
            # (13 unchanged elements hidden)
        } -> null
      - dn         = "uni/tn-Techtorial/ap-DEV/epg-VLAN102" -> null
      - id         = "uni/tn-Techtorial/ap-DEV/epg-VLAN102" -> null
        # (1 unchanged attribute hidden)
    }

  # module.aci.module.aci_endpoint_group["Techtorial/DEV/VLAN103"].aci_rest_managed.fvAEPg has been deleted
  - resource "aci_rest_managed" "fvAEPg" {
      - content    = {
          - "name"           = "VLAN103"
            # (13 unchanged elements hidden)
        } -> null
      - dn         = "uni/tn-Techtorial/ap-DEV/epg-VLAN103" -> null
      - id         = "uni/tn-Techtorial/ap-DEV/epg-VLAN103" -> null
        # (1 unchanged attribute hidden)
    }

  # module.aci.module.aci_tenant["Techtorial"].aci_rest_managed.fvTenant has been deleted
  - resource "aci_rest_managed" "fvTenant" {
      - content    = {
          - "name"      = "Techtorial"
            # (5 unchanged elements hidden)
        } -> null
      - id         = "uni/tn-Techtorial" -> null
        # (2 unchanged attributes hidden)
    }

  # module.aci.module.aci_vrf["Techtorial/VRF1"].aci_rest_managed.fvCtx has been deleted
  - resource "aci_rest_managed" "fvCtx" {
      - content    = {
          - "name"                = "VRF1"
            # (11 unchanged elements hidden)
        } -> null
      - dn         = "uni/tn-Techtorial/ctx-VRF1" -> null
      - id         = "uni/tn-Techtorial/ctx-VRF1" -> null
        # (1 unchanged attribute hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.aci.local_sensitive_file.defaults[0] will be created
  + resource "local_sensitive_file" "defaults" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0700"
      + file_permission      = "0700"
      + filename             = "defaults.yaml"
      + id                   = (known after apply)
    }

  # module.aci.module.aci_application_profile["Techtorial/DEV"].aci_rest_managed.fvAp will be created
  + resource "aci_rest_managed" "fvAp" {
      + class_name = "fvAp"
      + content    = {
          + "descr"     = ""
          + "name"      = "DEV"
          + "nameAlias" = ""
        }
      + dn         = "uni/tn-Techtorial/ap-DEV"
      + id         = (known after apply)
    }

  # module.aci.module.aci_bridge_domain["Techtorial/VLAN101"].aci_rest_managed.fvBD will be created
  + resource "aci_rest_managed" "fvBD" {
      + class_name = "fvBD"
      + content    = {
          + "arpFlood"              = "yes"
          + "descr"                 = ""
          + "epMoveDetectMode"      = ""
          + "hostBasedRouting"      = "no"
          + "ipLearning"            = "yes"
          + "limitIpLearnToSubnets" = "yes"
          + "mac"                   = "00:22:BD:F8:19:FF"
          + "mcastAllow"            = "no"
          + "multiDstPktAct"        = "bd-flood"
          + "name"                  = "VLAN101"
          + "nameAlias"             = ""
          + "type"                  = "regular"
          + "unicastRoute"          = "yes"
          + "unkMacUcastAct"        = "flood"
          + "unkMcastAct"           = "flood"
          + "v6unkMcastAct"         = "flood"
          + "vmac"                  = ""
        }
      + dn         = "uni/tn-Techtorial/BD-VLAN101"
      + id         = (known after apply)
    }

  # module.aci.module.aci_bridge_domain["Techtorial/VLAN101"].aci_rest_managed.fvRsCtx will be created
  + resource "aci_rest_managed" "fvRsCtx" {
      + class_name = "fvRsCtx"
      + content    = {
          + "tnFvCtxName" = "VRF1"
        }
      + dn         = "uni/tn-Techtorial/BD-VLAN101/rsctx"
      + id         = (known after apply)
    }

  # module.aci.module.aci_bridge_domain["Techtorial/VLAN101"].aci_rest_managed.fvSubnet["10.1.0.1/24"] will be created
  + resource "aci_rest_managed" "fvSubnet" {
      + class_name = "fvSubnet"
      + content    = {
          + "ctrl"      = "nd"
          + "descr"     = ""
          + "ip"        = "10.1.0.1/24"
          + "preferred" = "no"
          + "scope"     = "private"
          + "virtual"   = "no"
        }
      + dn         = "uni/tn-Techtorial/BD-VLAN101/subnet-[10.1.0.1/24]"
      + id         = (known after apply)
    }

  # module.aci.module.aci_bridge_domain["Techtorial/VLAN102"].aci_rest_managed.fvBD will be created
  + resource "aci_rest_managed" "fvBD" {
      + class_name = "fvBD"
      + content    = {
          + "arpFlood"              = "yes"
          + "descr"                 = ""
          + "epMoveDetectMode"      = ""
          + "hostBasedRouting"      = "no"
          + "ipLearning"            = "yes"
          + "limitIpLearnToSubnets" = "yes"
          + "mac"                   = "00:22:BD:F8:19:FF"
          + "mcastAllow"            = "no"
          + "multiDstPktAct"        = "bd-flood"
          + "name"                  = "VLAN102"
          + "nameAlias"             = ""
          + "type"                  = "regular"
          + "unicastRoute"          = "yes"
          + "unkMacUcastAct"        = "flood"
          + "unkMcastAct"           = "flood"
          + "v6unkMcastAct"         = "flood"
          + "vmac"                  = ""
        }
      + dn         = "uni/tn-Techtorial/BD-VLAN102"
      + id         = (known after apply)
    }

  # module.aci.module.aci_bridge_domain["Techtorial/VLAN102"].aci_rest_managed.fvRsCtx will be created
  + resource "aci_rest_managed" "fvRsCtx" {
      + class_name = "fvRsCtx"
      + content    = {
          + "tnFvCtxName" = "VRF1"
        }
      + dn         = "uni/tn-Techtorial/BD-VLAN102/rsctx"
      + id         = (known after apply)
    }

  # module.aci.module.aci_bridge_domain["Techtorial/VLAN102"].aci_rest_managed.fvSubnet["10.1.1.1/24"] will be created
  + resource "aci_rest_managed" "fvSubnet" {
      + class_name = "fvSubnet"
      + content    = {
          + "ctrl"      = "nd"
          + "descr"     = ""
          + "ip"        = "10.1.1.1/24"
          + "preferred" = "no"
          + "scope"     = "private"
          + "virtual"   = "no"
        }
      + dn         = "uni/tn-Techtorial/BD-VLAN102/subnet-[10.1.1.1/24]"
      + id         = (known after apply)
    }

  # module.aci.module.aci_bridge_domain["Techtorial/VLAN103"].aci_rest_managed.fvBD will be created
  + resource "aci_rest_managed" "fvBD" {
      + class_name = "fvBD"
      + content    = {
          + "arpFlood"              = "yes"
          + "descr"                 = ""
          + "epMoveDetectMode"      = ""
          + "hostBasedRouting"      = "no"
          + "ipLearning"            = "yes"
          + "limitIpLearnToSubnets" = "yes"
          + "mac"                   = "00:22:BD:F8:19:FF"
          + "mcastAllow"            = "no"
          + "multiDstPktAct"        = "bd-flood"
          + "name"                  = "VLAN103"
          + "nameAlias"             = ""
          + "type"                  = "regular"
          + "unicastRoute"          = "yes"
          + "unkMacUcastAct"        = "flood"
          + "unkMcastAct"           = "flood"
          + "v6unkMcastAct"         = "flood"
          + "vmac"                  = ""
        }
      + dn         = "uni/tn-Techtorial/BD-VLAN103"
      + id         = (known after apply)
    }

  # module.aci.module.aci_bridge_domain["Techtorial/VLAN103"].aci_rest_managed.fvRsCtx will be created
  + resource "aci_rest_managed" "fvRsCtx" {
      + class_name = "fvRsCtx"
      + content    = {
          + "tnFvCtxName" = "VRF1"
        }
      + dn         = "uni/tn-Techtorial/BD-VLAN103/rsctx"
      + id         = (known after apply)
    }

  # module.aci.module.aci_bridge_domain["Techtorial/VLAN103"].aci_rest_managed.fvSubnet["10.1.2.1/23"] will be created
  + resource "aci_rest_managed" "fvSubnet" {
      + class_name = "fvSubnet"
      + content    = {
          + "ctrl"      = "nd"
          + "descr"     = ""
          + "ip"        = "10.1.2.1/23"
          + "preferred" = "no"
          + "scope"     = "private"
          + "virtual"   = "no"
        }
      + dn         = "uni/tn-Techtorial/BD-VLAN103/subnet-[10.1.2.1/23]"
      + id         = (known after apply)
    }

  # module.aci.module.aci_endpoint_group["Techtorial/DEV/VLAN101"].aci_rest_managed.fvAEPg will be created
  + resource "aci_rest_managed" "fvAEPg" {
      + class_name = "fvAEPg"
      + content    = {
          + "descr"        = ""
          + "floodOnEncap" = "disabled"
          + "fwdCtrl"      = ""
          + "name"         = "VLAN101"
          + "nameAlias"    = ""
          + "pcEnfPref"    = "unenforced"
          + "prefGrMemb"   = "exclude"
          + "prio"         = "unspecified"
        }
      + dn         = "uni/tn-Techtorial/ap-DEV/epg-VLAN101"
      + id         = (known after apply)
    }

  # module.aci.module.aci_endpoint_group["Techtorial/DEV/VLAN101"].aci_rest_managed.fvRsBd will be created
  + resource "aci_rest_managed" "fvRsBd" {
      + class_name = "fvRsBd"
      + content    = {
          + "tnFvBDName" = "VLAN101"
        }
      + dn         = "uni/tn-Techtorial/ap-DEV/epg-VLAN101/rsbd"
      + id         = (known after apply)
    }

  # module.aci.module.aci_endpoint_group["Techtorial/DEV/VLAN102"].aci_rest_managed.fvAEPg will be created
  + resource "aci_rest_managed" "fvAEPg" {
      + class_name = "fvAEPg"
      + content    = {
          + "descr"        = ""
          + "floodOnEncap" = "disabled"
          + "fwdCtrl"      = ""
          + "name"         = "VLAN102"
          + "nameAlias"    = ""
          + "pcEnfPref"    = "unenforced"
          + "prefGrMemb"   = "exclude"
          + "prio"         = "unspecified"
        }
      + dn         = "uni/tn-Techtorial/ap-DEV/epg-VLAN102"
      + id         = (known after apply)
    }

  # module.aci.module.aci_endpoint_group["Techtorial/DEV/VLAN102"].aci_rest_managed.fvRsBd will be created
  + resource "aci_rest_managed" "fvRsBd" {
      + class_name = "fvRsBd"
      + content    = {
          + "tnFvBDName" = "VLAN102"
        }
      + dn         = "uni/tn-Techtorial/ap-DEV/epg-VLAN102/rsbd"
      + id         = (known after apply)
    }

  # module.aci.module.aci_endpoint_group["Techtorial/DEV/VLAN103"].aci_rest_managed.fvAEPg will be created
  + resource "aci_rest_managed" "fvAEPg" {
      + class_name = "fvAEPg"
      + content    = {
          + "descr"        = ""
          + "floodOnEncap" = "disabled"
          + "fwdCtrl"      = ""
          + "name"         = "VLAN103"
          + "nameAlias"    = ""
          + "pcEnfPref"    = "unenforced"
          + "prefGrMemb"   = "exclude"
          + "prio"         = "unspecified"
        }
      + dn         = "uni/tn-Techtorial/ap-DEV/epg-VLAN103"
      + id         = (known after apply)
    }

  # module.aci.module.aci_endpoint_group["Techtorial/DEV/VLAN103"].aci_rest_managed.fvRsBd will be created
  + resource "aci_rest_managed" "fvRsBd" {
      + class_name = "fvRsBd"
      + content    = {
          + "tnFvBDName" = "VLAN103"
        }
      + dn         = "uni/tn-Techtorial/ap-DEV/epg-VLAN103/rsbd"
      + id         = (known after apply)
    }

  # module.aci.module.aci_tenant["Techtorial"].aci_rest_managed.fvTenant will be created
  + resource "aci_rest_managed" "fvTenant" {
      + class_name = "fvTenant"
      + content    = {
          + "descr"     = ""
          + "name"      = "Techtorial"
          + "nameAlias" = ""
        }
      + dn         = "uni/tn-Techtorial"
      + id         = (known after apply)
    }

  # module.aci.module.aci_vrf["Techtorial/VRF1"].aci_rest_managed.fvCtx will be created
  + resource "aci_rest_managed" "fvCtx" {
      + class_name = "fvCtx"
      + content    = {
          + "descr"               = ""
          + "ipDataPlaneLearning" = "enabled"
          + "name"                = "VRF1"
          + "nameAlias"           = ""
          + "pcEnfDir"            = "ingress"
          + "pcEnfPref"           = "enforced"
        }
      + dn         = "uni/tn-Techtorial/ctx-VRF1"
      + id         = (known after apply)
    }

  # module.aci.module.aci_vrf["Techtorial/VRF1"].aci_rest_managed.fvRsBgpCtxPol will be created
  + resource "aci_rest_managed" "fvRsBgpCtxPol" {
      + class_name = "fvRsBgpCtxPol"
      + content    = {
          + "tnBgpCtxPolName" = ""
        }
      + dn         = "uni/tn-Techtorial/ctx-VRF1/rsbgpCtxPol"
      + id         = (known after apply)
    }

  # module.aci.module.aci_vrf["Techtorial/VRF1"].aci_rest_managed.vzAny will be created
  + resource "aci_rest_managed" "vzAny" {
      + class_name = "vzAny"
      + content    = {
          + "descr"      = ""
          + "prefGrMemb" = "disabled"
        }
      + dn         = "uni/tn-Techtorial/ctx-VRF1/any"
      + id         = (known after apply)
    }

Plan: 21 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @novbalu*